{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "AU Transfer",
    "1": "Adjustment",
    "2": "Closing Notice",
    "3": "Commitment Change",
    "4": "Fee Payment",
    "5": "Money Movement - Outbound",
    "6": "Money Movement-Inbound"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "AU Transfer": 0,
    "Adjustment": 1,
    "Closing Notice": 2,
    "Commitment Change": 3,
    "Fee Payment": 4,
    "Money Movement - Outbound": 5,
    "Money Movement-Inbound": 6
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.50.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
